[{"source": "Channelnewsasia.com", "url": "https://www.channelnewsasia.com/news/business/thermo-fisher-agrees-to-buy-genetic-tester-qiagen-in-us-11-5-billion-deal-12496758", "imageurl": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12496754/16x9/991/557/c94ec4f0db139ef483ada4373d2810df/Xc/illustration-of-products-are-pictured-from-qiagen--the-diagnostics-company-which-has-agreed-an--11-5-billion-takeover-deal-with-u-s-based-thermo-fisher-1.jpg", "title": "Thermo Fisher agrees to buy genetic tester Qiagen in US$11.5 billion deal", "author": "CNA", "publishedDate": "2020-03-03T16:01:46Z", "content": "FRANKFURT/BENGALURU: Thermo Fisher Scientific Inc  has agreed to buy German genetic testing company Qiagen   in a US$11.5 billion deal as the U.S.-based group looks to bolster its health diagnostic business.\nQiagen, which has its main operations in Germany but is headquartered in the neighbouring Netherlands, is one of the world's largest suppliers of products to prepare tissue and blood samples for advanced testing.\nThese genetic tests play a major role in research and treatment of cancer, infectious diseases and genetic disorders.\nLast month it also began shipping a new rapid testing kit for the coronavirus to hospitals in China.\nAt 39 euros per share, the cash offer was pitched at a 23per cent premium to Qiagen's closing price on Monday, Qiagen said, adding the bid valued the company at 10.4 billion euros (US$11.5 billion), including 1.26 billion euros in net debt.\nQiagen shares rose 18per cent on the news to 37.5 euros, on track for their best daily gain in two decades.\nThermo Fisher, which has a market valuation of around US$120 billion, provides instruments, software and other services for the scientific research and healthcare sectors.\nThe deal is designed to help the company advance its precision medicine through new molecular diagnostic services.\n\"This acquisition provides us with the opportunity to leverage our industry-leading capabilities and R&D expertise to accelerate innovation and address emerging healthcare needs,\" Thermo Fisher CEO Marc Casper said in a statement.\nShares in Thermo Fisher were indicated 1.7per cent higher after the deal was announced.\nQIAGEN'S TOUGH YEAR\nThe deal, which is expected to be completed in the first half of 2021, will immediately add to earnings after the deal closes, the companies said.\nThermo Fisher said the deal would generate US$200 million in savings by three years after the deal's close.\nJefferies analysts said they had long viewed Qiagen's strong position in research labs, plus front-end prep for molecular diagnostics as attractive to larger life science conglomerates.\nFor Qiagen, the deal comes after a tumultuous few months.\nThe company said last November that it had started to review options, including a sale, after receiving indications of interest from potential suitors. Thermo Fisher was reported as one of the possible bidders at that point.\nHowever, the following month Qiagen said it had decided its best option was to remain a standalone business.\nThe company's long-serving CEO Peer Schatz resigned in October when it announced a reversal of its strategy, saying it would stop developing its next-generation genome sequencing machines and instead collaborate with industry leader Illumina .\nJPMorgan  and Morgan Stanley  served as financial advisers to Thermo Fisher, while Wachtell, Lipton, Rosen & Katz provided legal counsel.\nFor Qiagen, Goldman Sachs  is lead financial advisor and Barclays  is serving as financial adviser, while De Brauw Blackstone Westbroek NV, Linklaters LLP and Mintz, Levin, Cohn, Ferris, Glovsky and Popeo P.C. are serving as legal counsel.\n(Editing by Susan Fenton and David Evans)\n"}, {"source": "Straitstimes.com", "url": "https://www.straitstimes.com/singapore/health/two-new-coronavirus-cases-in-singapore-one-linked-to-wizlearn-technologies-no-new", "imageurl": "https://www.straitstimes.com/sites/default/files/styles/x_large/public/articles/2020/03/03/ycwiz030320.jpg?itok=LzjewyuE", "title": "Two new coronavirus cases in Singapore, one linked to Wizlearn Technologies; no new patients discharged", "author": "Timothy Goh", "publishedDate": "2020-03-03T12:13:34Z", "content": "SINGAPORE - Two more cases of the coronavirus were confirmed in Singapore on Tuesday (March 3), bringing the number of people who have tested positive in the country to 110.\nOne of these, Case 110, has links to the cluster at Wizlearn Technologies, while contact tracing is under way to determine links for the other case.\nNo new patients were discharged, meaning the number of those fully recovered remains at 78, said the Ministry of Health (MOH).\nMOH said on Tuesday that of the 32 confirmed cases still in hospital, most are stable, while seven are in critical condition in the intensive care unit, one more than on Monday.\nCase 109 is a 70 year-old male Singapore citizen who has no recent travel history to affected countries and regions.\nHe is currently warded in an isolation room at the Singapore General Hospital (SGH).\nHe reported onset of symptoms on Feb 25 and had sought treatment at a general practitioner (GP) clinic on Feb 27 and 28.\nHe went to SGH on Feb 29 and was immediately isolated. Subsequent test results confirmed infection on Monday afternoon.\nPrior to hospital admission, he had gone to work at Fish Mart Sakuraya at 154 West Coast Road but had not served customers or handled food. He lives in Everton Park.\nCase 110 is a 33 year-old male Singapore Citizen who has no recent travel history to affected countries and regions. He is currently warded in an isolation room at the National Centre for Infectious Diseases.\nTo date, 336 people are being quarantined and 2,837 people have completed their quarantine.\nThe clusters that have emerged here are Wizlearn Technologies, the Yong Thai Hang health products shop, the Grand Hyatt Singapore, a Seletar Aerospace Heights construction site, and the clusters at Grace Assembly of God and the Life Church and Missions Singapore that are now considered one cluster as a result of the earlier discovery of a missing link between the two.\nEarlier on Tuesday, Singapore's multi-ministry task force announced that recent travellers from South Korea, northern Italy and Iran, which have seen a spike in recent cases of the virus, would not be allowed to enter or transit through Singapore.\nAs of noon on Tuesday, 90,689 cases of Covid-19 have been reported globally, with 10,538 of them outside China where the virus emerged.\nSouth Korea has 4,812 cases, Italy has 1,835, mostly in the northern region, while Iran has 1,501 and Japan had 268.\nSingapore's Minister for National Development Lawrence Wong, who co-chairs the task force, said: \"Despite our very best efforts, we have to be mentally prepared for the number of infected cases in Singapore to go up. I think the experience so far these past few days in Singapore where the number of cases rises by just a handful everyday, we've become accustomed to it.\n\"But this may not be the norm and it can change very easily. You see this in other countries too, where you have very few cases for a few days and then suddenly, one incident occurs, one event occurs, and there is a sharp spike in cases and sustained transmission. This has happened elsewhere; it can happen in Singapore too.\"\n"}]